package com.rbkmoney.adapter.starrys.service.starrys.constant;

/**
 * Комманды
 */
public class Command {

    /**
     * продолжить выполнение пакета при ошибках анализа содержимого поля Request или при ошибке в поле Path
     */
    public static final String CONTINUE_WHEN_TRANSPORT_ERROR = "ContinueWhenTransportError";

    /**
     * продолжить выполнение пакета при ошибке выполнения команды протокола.
     */
    public static final String CONTINUE_WHEN_DEVICE_ERROR = "ContinueWhenDeviceError";


    /**********************************************************************************************************
     *                                             WHEN_TRUE                                                  *
     *********************************************************************************************************/

    /**
     * пропустить команду, если результат функции в параметре true.
     */
    public static final String SKIP_WHEN_TRUE = "SkipWhenTrue";

    /**
     * остановить выполнение пакета, если результат функции в параметре true.
     */
    public static final String STOP_WHEN_TRUE = "StopWhenTrue";


    /**********************************************************************************************************
     *                                           SKIP_WHEN_MODE                                               *
     *********************************************************************************************************/

    /**
     * пропустить команду, если устройство находится в состояниях, указанных в списке параметров опции.
     */
    public static final String SKIP_WHEN_MODE_IN = "SkipWhenModeIn";

    /**
     * пропуститькоманду,еслиустройствоненаходитсявсостояниях,указанных в списке параметров опции.
     */
    public static final String SKIP_WHEN_MODE_NOT_IN = "SkipWhenModeNotIn";


    /**********************************************************************************************************
     *                                           STOP_WHEN_MODE                                               *
     *********************************************************************************************************/

    /**
     * остановить выполнение пакета, если устройство находится в состояниях, указанных в списке параметров опции
     */
    public static final String STOP_WHEN_MODE_IN = "StopWhenModeIn";

    /**
     * остановить выполнение пакета, если устройство не находится в состояниях, указанных в списке параметров опции
     */
    public static final String STOP_WHEN_MODE_NOT_IN = "StopWhenModeNotIn";

    /***
     * NOTE: Вышеперечисленные опции в качестве значения (параметра) принимают список кодов состояния устройства.
     */


    /**********************************************************************************************************
     *                                       SKIP_WHEN_DOCS_IN_TURN                                           *
     *********************************************************************************************************/

    /**
     * пропустить команду, если количество документов в смене меньше чем указано в параметре опции
     */
    public static final String SKIP_WHEN_DOCS_IN_TURN_LESS_THEN = "SkipWhenDocsInTurnLessThen";

    /**
     * пропустить команду, если количество документов в смене больше или равно параметру опции
     */
    public static final String SKIP_WHEN_DOCS_IN_TURN_GREAT_OR_EQUAL_THEN = "SkipWhenDocsInTurnGreatOrEqualThen";


    /**********************************************************************************************************
     *                                       STOP_WHEN_DOCS_IN_TURN                                           *
     *********************************************************************************************************/

    /**
     * остановить выполнение пакета, если количество документов в смене меньше чем указано в параметре опции.
     */
    public static final String STOP_WHEN_DOCS_IN_TURN_LESS_THEN = "StopWhenDocsInTurnLessThen";

    /**
     * остановить выполнение пакета, если количество документов в смене больше или равно параметру опции
     */
    public static final String STOP_WHEN_DOCS_IN_TURN_GREAT_OR_EQUAL_THEN = "StopWhenDocsInTurnGreatOrEqualThen";

    /**
     * NOTE: Вышеперечисленные опции в качестве значения (параметра) принимают число.
     */

}
